package org.example.house;

public class Task {
      /* Creature был бы абстрактным классом на верху иерархии всех обитателей дома
    метод abstract void sayHello() находился в Creature
    Human и Robot наследовали от Creature
    у класса Human появилась возможность выгуливать животных - метод
    walk(Animal animal). После прогулки животное становится голодным.
    Создать метод play(Creature another) так, чтобы все обитатели дома умели
    бы играть друг с другом. При игре выводится сообщение, кто с кем играет.
    Доработать метод play() у подклассов так, чтобы при попытке игры кошек с собаками:
    dog.play(cat) - собака бы лаяла на кошку
    cat.play(dog) - кошка бы убегала

    Проверить работу классов*/
}
